## Project 2
C:\Users\GMamire\OneDrive - I-TECH Zimbabwe\Pictures

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [101]:
salaries = pd.read_csv('C:/Users/GMamire/OneDrive - I-TECH Zimbabwe/Pictures/Salaries.csv', low_memory=False)

In [102]:
salaries.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [4]:
sal = salaries.copy()

### 5. Check Null values in a dataset

In [5]:
sal.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

### 6. Drop Id, Notes, Agency, and Status columns

In [6]:
sal.drop(labels=['Id', 'Notes', 'Agency', 'Status'], axis=1, inplace=True)

In [7]:
sal.head(2)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011

### 7. Get overall statistics about the dataset

In [8]:
sal.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [9]:
sal.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049,148654,148654,112495,148654.000000,148654.000000,148654.000000
unique,110811,2159,109724,66162,84243,98647,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,872,57868,30068,1024,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

### 8. Find the occurrence of the employees names (top 5)

In [10]:
sal.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [11]:
sal['EmployeeName'].value_counts().head(5)

EmployeeName
Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: count, dtype: int64

In [12]:
sal.EmployeeName.value_counts().head(5)

EmployeeName
Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: count, dtype: int64

### 9. Find the number of unique job titles

In [13]:
sal.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [14]:
sal.JobTitle.nunique()

2159

### 10. Total number of job titles that contain Captain

In [15]:
sal['JobTitle'].str.contains('Captain')

0         False
1         False
2         False
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [16]:
sal['JobTitle'].str.contains('Captain', case=True).value_counts()

JobTitle
False    148243
True        411
Name: count, dtype: int64

In [17]:
sal[sal['JobTitle'].str.contains('Captain', case=True)]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
36167,John Goldberg,Captain 3,104404.0,0.0,245999.41,24287.23,350403.41,374690.64,2012
36180,Michael Rolovich,"Captain, Fire Suppression",145659.03,125868.06,30474.97,45129.03,302002.06,347131.09,2012
36184,Darryl Hunter,"Captain, Fire Suppression",145659.03,115673.73,32610.0,49571.51,293942.76,343514.27,2012
36186,Michael Delane,"Captain, Fire Suppression",147069.71,113372.94,33012.58,45978.15,293455.23,339433.38,2012
36189,Philip Stevens,"Captain, Fire Suppression",124573.5,53895.92,130200.4,28907.03,308669.82,337576.85,2012
...,...,...,...,...,...,...,...,...,...
116604,Gregory L Stewart,"Captain, Fire Suppression",73355.21,18517.18,49917.73,25608.77,141790.12,167398.89,2014
120867,Michael J Moran,Captain 3,7660.00,1496.09,126560.36,2189.51,135716.45,137905.96,2014
122361,Michael V Rolovich,"Captain, Fire Suppression",0.00,0.00,130320.75,0.00,130320.75,130320.75,2014
126588,Stephen M Tittel,Captain 3,68491.89,0.00,23721.91,19020.79,92213.80,111234.59,2014
132232,Jeanne M Seyler,"Captain, Fire Suppression",61039.43,2285.30,7548.29,20113.76,70873.02,90986.78,2014

In [18]:
sal[sal['JobTitle'].str.contains('Captain', case=False)].count()

EmployeeName        552
JobTitle            552
BasePay             551
OvertimePay         552
OtherPay            552
Benefits            411
TotalPay            552
TotalPayBenefits    552
Year                552
dtype: int64

### 11. Display all Employee Names from the Fire Department

In [19]:
sal.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [20]:
sal[sal['JobTitle'].str.contains('FIRE', case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

In [24]:
sal[sal['JobTitle'].str.contains('FIRE')]['EmployeeName']

4           PATRICK GARDNER
6                 ALSON LEE
8            MICHAEL MORRIS
9        JOANNE HAYES-WHITE
10            ARTHUR KENNEY
                ...
34790       CHARLES JOHNSON
34927         THOMAS LEEPER
35811         ROBERTO LUCHA
36076           DEBRA TANIS
36153         ROCK CRAWFORD
Name: EmployeeName, Length: 1459, dtype: object

In [25]:
5879-1459

4420

### 12. Find Min, Max, and Avg Base Salary

In [56]:
sal.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [57]:
sal.BasePay.unique()

array(['167411.18', '155966.02', '212739.13', ..., '6.04', '15.50',
       'Not Provided'], dtype=object)

In [58]:
sal_drop = sal.copy()

In [59]:
# Replace 'Not Provided' with NaN
sal_drop['BasePay'] = sal_drop['BasePay'].replace('Not Provided', np.nan)

In [60]:
sal_drop = sal_drop.dropna(subset=['BasePay'])

In [61]:
sal_drop.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011

In [64]:
sal_drop.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [68]:
sal_drop.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay                 0
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [69]:
sal_drop.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148045 entries, 0 to 148653
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      148045 non-null  object
 1   JobTitle          148045 non-null  object
 2   BasePay           148045 non-null  object
 3   OvertimePay       148045 non-null  object
 4   OtherPay          148045 non-null  object
 5   Benefits          111886 non-null  object
 6   TotalPay          148045 non-null  float64
 7   TotalPayBenefits  148045 non-null  float64
 8   Year              148045 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 11.3+ MB

In [74]:
# Convert BasePay to numeric (this will convert valid entries and leave NaN as is)
sal_drop['BasePay'] = pd.to_numeric(sal_drop['BasePay'], errors='coerce')

# Drop rows where BasePay is NaN
sal_drop = sal_drop.dropna(subset=['BasePay'])

# Convert BasePay to int64 after ensuring it contains no decimal values
sal_drop['BasePay'] = sal_drop['BasePay'].astype('float64').astype('int64')

In [75]:
sal_drop.dtypes

EmployeeName         object
JobTitle             object
BasePay               int64
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [77]:
sal_drop['BasePay'].describe()

count    148045.000000
mean      66325.061907
std       42764.663871
min        -166.000000
25%       33588.000000
50%       65007.000000
75%       94691.000000
max      319275.000000
Name: BasePay, dtype: float64

### 13. Replace Not provided in Employee Name Column to NAN

In [80]:
sal_drop.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [82]:
sal.EmployeeName

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [83]:
sal_emp = sal.copy()

In [86]:
sal_emp['EmployeeName'] = sal_emp['EmployeeName'].replace('Not provided', np.nan)

In [87]:
sal_emp['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

### 14. Drop the rows having 5 Missing Values

In [110]:
salaries[salaries.isnull().sum(axis=1)==3]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
110526,110527,Arthur L Curry,PS Aide Health Services,NaN,0.0,10.67,0.0,10.67,10.67,2013,NaN,San Francisco,NaN
110527,110528,Nereida Vega,Senior Clerk,NaN,0.0,5.56,0.0,5.56,5.56,2013,NaN,San Francisco,NaN
110528,110529,Timothy E Gibson,Police Officer 3,NaN,0.0,0.0,-2.73,0.00,-2.73,2013,NaN,San Francisco,NaN
110529,110530,Mark E Laherty,Police Officer 3,NaN,0.0,0.0,-8.2,0.00,-8.20,2013,NaN,San Francisco,NaN
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.00,-33.89,2013,NaN,San Francisco,NaN

In [114]:
salaries.drop(salaries[salaries.isnull().sum(axis=1)==3].index, axis=0, inplace=True)

In [116]:
salaries.isnull().sum(axis=1)

36159     2
36160     2
36161     2
36162     2
36163     2
         ..
148649    1
148650    2
148651    2
148652    2
148653    1
Length: 111890, dtype: int64

### 15. Find job title of Albert Pardini

In [118]:
salaries.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [121]:
salaries[salaries['EmployeeName'] == 'Albert Pardini']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
36519,36520,Albert Pardini,Captain 3,196265.04,0.0,11404.04,46326.21,207669.08,253995.29,2012,NaN,San Francisco,NaN

In [122]:
salaries[salaries['EmployeeName'] == 'Albert Pardini'] ['JobTitle']

36519    Captain 3
Name: JobTitle, dtype: object

### 16. How much Albert Pardini make include benefits

In [125]:
salaries[salaries['EmployeeName']=='Albert Pardini'] ['TotalPayBenefits']

36519    253995.29
Name: TotalPayBenefits, dtype: float64

### 17. Display name of the person having the highest BasePay

In [142]:
sal_drop[sal_drop['BasePay'].max()==sal_drop['BasePay']]

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
72925,Gregory P Suhr,Chief of Police,319275,0.0,20007.06,86533.21,339282.07,425815.28,2013

In [145]:
sal_drop[sal_drop['BasePay'].max()==sal_drop['BasePay']] [['EmployeeName','JobTitle']]

         EmployeeName         JobTitle
72925  Gregory P Suhr  Chief of Police

### 18. Find the average base pay of all Employees per year

In [148]:
sal_drop.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [152]:
sal_drop.groupby('Year').mean('BasePay')

           BasePay      TotalPay  TotalPayBenefits
Year
2011  63595.525872  71744.103871      71744.103871
2012  65435.992819  74113.262265     100553.229232
2013  69629.661009  78808.285041     102939.981346
2014  66564.085390  75471.836912     100261.438668

### 19. Find the average base pay of all Employees per JobTitle

In [156]:
sal_drop.dtypes

EmployeeName         object
JobTitle             object
BasePay               int64
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [159]:
sal_drop.groupby('JobTitle').mean('BasePay')

,BasePay,TotalPay,TotalPayBenefits,Year
JobTitle,,,,
ACCOUNT CLERK,43300.144578,44035.664337,44035.664337,2011.00
ACCOUNTANT,46643.000000,47429.268000,47429.268000,2011.00
ACCOUNTANT INTERN,28732.229167,29031.742917,29031.742917,2011.00
"ACPO,JuvP, Juv Prob (SFERS)",62290.000000,62290.780000,80266.370000,2014.00
ACUPUNCTURIST,66374.000000,67594.400000,67594.400000,2011.00
...,...,...,...,...
X-RAY LABORATORY AIDE,47664.230769,52705.880385,52705.880385,2011.00
X-Ray Laboratory Aide,46085.970000,50823.942700,69521.123200,2013.04
"YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS",52609.000000,53632.870000,53632.870000,2011.00
Youth Comm Advisor,39077.250000,41414.307500,60118.550000,2013.00
ZOO CURATOR,43148.000000,66686.560000,66686.560000,2011.00

In [162]:
# Group by JobTitle and calculate the mean of BasePay
mean_base_pay = sal_drop.groupby('JobTitle')['BasePay'].mean()

In [161]:
mean_base_pay

JobTitle
ACCOUNT CLERK                                     43300.144578
ACCOUNTANT                                        46643.000000
ACCOUNTANT INTERN                                 28732.229167
ACPO,JuvP, Juv Prob (SFERS)                       62290.000000
ACUPUNCTURIST                                     66374.000000
                                                      ...
X-RAY LABORATORY AIDE                             47664.230769
X-Ray Laboratory Aide                             46085.970000
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.000000
Youth Comm Advisor                                39077.250000
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2154, dtype: float64

### 20. Find average BasePay of Employee having Job title ACCOUNTANT

In [166]:
sal_drop.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [171]:
sal_drop[sal_drop['JobTitle']=='ACCOUNTANT']

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
19263,CARLITO NEPACENA,ACCOUNTANT,65392,0.0,0.0,NaN,65392.01,65392.01,2011
19324,ROSALINDA TAN,ACCOUNTANT,65225,0.0,0.0,NaN,65225.31,65225.31,2011
20992,NELSON ALVARADO,ACCOUNTANT,60076,0.0,0.0,NaN,60076.24,60076.24,2011
25927,JEANETTE COOPER,ACCOUNTANT,42522,0.0,2782.08,NaN,45304.38,45304.38,2011
35285,CESAR PALARCA,ACCOUNTANT,0,0.0,1148.4,NaN,1148.40,1148.40,2011

In [173]:
sal_drop[sal_drop['JobTitle']=='ACCOUNTANT']['BasePay'].mean()

46643.0

### 21. Find top 5 most common jobs

In [177]:
sal_drop['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: count, dtype: int64